[{
  "title": "Node is a movement",
  "slug": "node-movement",
  "published": true,
  "text": "In one random deployment, it is often assumed that the number of scattered sensors are more than that required by the critical sensor density. Otherwise, complete area coverage may not be guaranteed in this deployment, and some coverage holes may exist. Besides using more sensors to improve coverage, mobile sensor nodes can be used to improve network coverage. Mobile sensor nodes are equipped with mobile platforms and can move around after initial deployment. Although a mobile sensor node normally is more expensive than its stationary compeer, it can serve many functionalities and improve network coverage. The design of a node movement strategy usually needs to address the following question:Where to move and how to efficiently move mobile modes so that area coverage can be optimized? \nIn different network scenarios, the objectives of nodes’ movement are different. In a hybrid network consisting of both stationary and mobile sensor nodes, the objective is mainly to relocate mobile nodes to heal the coverage holes caused by the stationary nodes. In a mobile network consisting of only mobile nodes, the primary objective is to maximize the coverage of these mobile nodes, and in event monitoring scenario, an important objective is to dispatch mobile nodes to the sources of events for better event coverage."  
}, {
  "title": "Express.js Experience",
  "slug": "express-experience",
  "text": "Work in progress",
  "published": false
},{
  "title": "Node.js FUNdamentals: A Concise Overview of The Main Concepts",
  "slug": "node-fundamentals",
  "published": true,
  "text": "Node.js is a highly efficient and scalable non-blocking I/O platform that was build on top of Google Chrome V8 engine and its ECMAScript. This means that most front-end JavaScript (another implementation of ECMAScript) objects, functions and methods are available in Node.js. Please refer to JavaScript FUNdamentals if you need a refresher on JS-specific basics."
  }]